In [5]:
%%writefile data/sea_rain1.csv

연도,동해,남해,서해,전체
1996,15,16,17,18
1997,13,14,15,16
1998,17,16,15,14
1999,18,18,17,17

Overwriting data/sea_rain1.csv

In [8]:
import pandas as pd
import numpy as np

data = pd.read_csv("data/sea_rain1.csv", index_col = "연도")
data

      동해  남해  서해  전체
연도
1996  15  16  17  18
1997  13  14  15  16
1998  17  16  15  14
1999  18  18  17  17

In [11]:
data2 = pd.read_csv("data/sea_rain2.csv", index_col = "연도", encoding = "ANSI")
data2

      동해  남해  서해  전체
연도
1996  15  16  17  18
1997  13  14  15  16
1998  17  16  15  14
1999  18  18  17  17